whiteListpair/whiteListPairRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:siemens:names:prov:gw:SPML:2:0">
	<soapenv:Header/>
	<soapenv:Body>
		<spml:batchRequest language="en_en" xmlns:spml="urn:siemens:names:prov:gw:SPML:2:0" xmlns:subscriber="urn:siemens:names:prov:gw:EIR_NSR:1:0">
			<version>EIR_NSR_v30</version>
			<request xsi:type="spml:ModifyRequest" requestID="$requestID$" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
				<version>EIR_NSR_v30</version>
				<objectclass>Device</objectclass>
				<identifier>$imei$</identifier>
				<modification operation="addorset" scope="uniqueTypeMapping">
					<valueObject xmlns:ns2="urn:siemens:names:prov:gw:EIR_NSR:1:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ns2:Device">
          $startRepeat$<lockedImsi>
							<imsi>$imsi$</imsi>
						</lockedImsi>$endRepeat$
				</valueObject>
			</modification>
		</request>
	</spml:batchRequest>
</soapenv:Body>
</soapenv:Envelope>